In [1]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder
from sklearn.model_selection import train_test_split as tts
from sklearn.linear_model import LinearRegression
from sklearn.tree import DecisionTreeClassifier
from sklearn.metrics import mean_absolute_error
from sklearn.metrics import f1_score

In [2]:
titanic = pd.read_csv('titanic.csv')

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
titanic.drop(['Name','Ticket', 'Fare', 'Cabin', 'PassengerId'], axis=1, inplace=True)

## заменим категориальные переменные

In [5]:
le = LabelEncoder()
le.fit(titanic.Sex)
titanic.Sex = le.transform(titanic.Sex)

In [6]:
le.fit(titanic.Embarked)
titanic.Embarked = le.transform(titanic.Embarked)

In [7]:
titanic.tail()

     Survived  Pclass  Sex   Age  SibSp  Parch  Embarked
886         0       2    1  27.0      0      0         2
887         1       1    0  19.0      0      0         2
888         0       3    0   NaN      1      2         2
889         1       1    1  26.0      0      0         0
890         0       3    1  32.0      0      0         1

In [8]:
titanic.isna().sum()

Survived      0
Pclass        0
Sex           0
Age         177
SibSp         0
Parch         0
Embarked      0
dtype: int64

In [9]:
titanic.dropna(subset=['Embarked'],inplace=True)

In [10]:
titanic.Age.fillna(round(titanic.Age.mean(),0), inplace = True)

In [11]:
titanic.isna().sum()

Survived    0
Pclass      0
Sex         0
Age         0
SibSp       0
Parch       0
Embarked    0
dtype: int64

## поделим датасет на тестовую и тренировочную выборки

In [12]:
RS = 512
x_train, x_test, y_train, y_test = tts(titanic.drop('Age', axis=1),
                                      titanic.Age,
                                      test_size = 0.3,
                                      random_state = RS)

## линейная регрессия

In [13]:
lr = LinearRegression()
lr.fit(x_train, y_train)
pred = lr.predict(x_test)

In [14]:
print('Ошибка на тестовой выборке', mean_absolute_error(y_test, pred))
print('Ошибка на обучающей выборке', mean_absolute_error(y_train, lr.predict(x_train)))

Ошибка на тестовой выборке 9.08884075209611
Ошибка на обучающей выборке 8.860435717939072

## дерево решений

In [15]:
dtc = DecisionTreeClassifier()

In [16]:
le.fit(titanic.Age)
titanic.Age = le.transform(titanic.Age)

In [17]:
titanic

     Survived  Pclass  Sex  Age  SibSp  Parch  Embarked
0           0       3    1   28      1      0         2
1           1       1    0   51      1      0         0
2           1       3    0   34      0      0         2
3           1       1    0   47      1      0         2
4           0       3    1   47      0      0         2
..        ...     ...  ...  ...    ...    ...       ...
886         0       2    1   35      0      0         2
887         1       1    0   24      0      0         2
888         0       3    0   39      1      2         2
889         1       1    1   34      0      0         0
890         0       3    1   42      0      0         1

[891 rows x 7 columns]

In [18]:
RS = 512
x_train, x_test, y_train, y_test = tts(titanic.drop('Age', axis=1),
                                      titanic.Age,
                                      test_size = 0.3,
                                      random_state = RS)

In [19]:
dtc.fit(x_train, y_train)
pred = dtc.predict(x_test)

In [20]:
print('качество на тестовой выборке', f1_score(y_test,pred, average='weighted'))

качество на тестовой выборке 0.10855389417475891